# CA-YOLOv8-P2: Context-Aware YOLOv8 with P2 Small Object Detection Head
# 4-head detection (P2, P3, P4, P5) for enhanced small object (ID card) detection
# Use this when accuracy on small ID cards is the top priority

# Parameters
nc: 2  # number of classes: card, person
scales:
  m: [0.67, 0.75, 768]  # YOLOv8m base

# Backbone with CBAM attention
backbone:
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, CBAM, [128]]             # 3  ← CBAM (P2)
  - [-1, 1, Conv, [256, 3, 2]]       # 4-P3/8
  - [-1, 6, C2f, [256, True]]        # 5
  - [-1, 1, CBAM, [256]]             # 6  ← CBAM (P3)
  - [-1, 1, Conv, [512, 3, 2]]       # 7-P4/16
  - [-1, 6, C2f, [512, True]]        # 8
  - [-1, 1, CBAM, [512]]             # 9  ← CBAM (P4)
  - [-1, 1, Conv, [1024, 3, 2]]      # 10-P5/32
  - [-1, 3, C2f, [1024, True]]       # 11
  - [-1, 1, CBAM, [1024]]            # 12 ← CBAM (P5)
  - [-1, 1, SPPF, [1024, 5]]         # 13

# Head: 4-scale detection with P2 head for small objects
head:
  # --- Top-down: P5 → P4 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 9], 1, Concat, [1]]        # 15
  - [-1, 3, C2f, [512]]              # 16
  - [-1, 1, CoordAtt, [512]]         # 17

  # --- Top-down: P4 → P3 ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 6], 1, Concat, [1]]        # 19
  - [-1, 3, C2f, [256]]              # 20
  - [-1, 1, CoordAtt, [256]]         # 21

  # --- Top-down: P3 → P2 (NEW for small objects) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 22
  - [[-1, 3], 1, Concat, [1]]        # 23  cat with P2 CBAM features
  - [-1, 3, C2f, [128]]              # 24  (P2/4-xsmall detection)
  - [-1, 1, CoordAtt, [128]]         # 25

  # --- Bottom-up: P2 → P3 ---
  - [-1, 1, Conv, [128, 3, 2]]       # 26
  - [[-1, 21], 1, Concat, [1]]       # 27
  - [-1, 3, C2f, [256]]              # 28  (P3/8-small)

  # --- Bottom-up: P3 → P4 ---
  - [-1, 1, Conv, [256, 3, 2]]       # 29
  - [[-1, 17], 1, Concat, [1]]       # 30
  - [-1, 3, C2f, [512]]              # 31  (P4/16-medium)

  # --- Bottom-up: P4 → P5 ---
  - [-1, 1, Conv, [512, 3, 2]]       # 32
  - [[-1, 13], 1, Concat, [1]]       # 33
  - [-1, 3, C2f, [1024]]             # 34  (P5/32-large)

  # --- 4-scale Detection ---
  - [[25, 28, 31, 34], 1, Detect, [nc]]  # 35  Detect(P2, P3, P4, P5)
