# CA-YOLOv8: Context-Aware YOLOv8 with CBAM + Coordinate Attention
# Standard 3-head detection (P3, P4, P5) with attention modules
# Optimized for ID card + person detection

# Parameters
nc: 2  # number of classes: card, person
scales:
  # [depth_multiple, width_multiple, max_channels]
  m: [0.67, 0.75, 768]  # YOLOv8m base

# CA-YOLOv8 Backbone with CBAM attention after each C2f stage
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # 0-P1/2    (320x320)
  - [-1, 1, Conv, [128, 3, 2]]       # 1-P2/4    (160x160)
  - [-1, 3, C2f, [128, True]]        # 2
  - [-1, 1, CBAM, [128]]             # 3         ← CBAM attention (P2 features)
  - [-1, 1, Conv, [256, 3, 2]]       # 4-P3/8    (80x80)
  - [-1, 6, C2f, [256, True]]        # 5
  - [-1, 1, CBAM, [256]]             # 6         ← CBAM attention (P3 features)
  - [-1, 1, Conv, [512, 3, 2]]       # 7-P4/16   (40x40)
  - [-1, 6, C2f, [512, True]]        # 8
  - [-1, 1, CBAM, [512]]             # 9         ← CBAM attention (P4 features)
  - [-1, 1, Conv, [1024, 3, 2]]      # 10-P5/32  (20x20)
  - [-1, 3, C2f, [1024, True]]       # 11
  - [-1, 1, CBAM, [1024]]            # 12        ← CBAM attention (P5 features)
  - [-1, 1, SPPF, [1024, 5]]         # 13        Spatial Pyramid Pooling

# CA-YOLOv8 Head with Coordinate Attention in neck
head:
  # --- Top-down pathway (FPN) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 9], 1, Concat, [1]]        # 15  cat P5_up + P4_cbam
  - [-1, 3, C2f, [512]]              # 16
  - [-1, 1, CoordAtt, [512]]         # 17        ← Coordinate Attention

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 18
  - [[-1, 6], 1, Concat, [1]]        # 19  cat P4_up + P3_cbam
  - [-1, 3, C2f, [256]]              # 20  (P3/8-small)
  - [-1, 1, CoordAtt, [256]]         # 21        ← Coordinate Attention

  # --- Bottom-up pathway (PAN) ---
  - [-1, 1, Conv, [256, 3, 2]]       # 22
  - [[-1, 17], 1, Concat, [1]]       # 23  cat P3_down + P4_neck
  - [-1, 3, C2f, [512]]              # 24  (P4/16-medium)
  - [-1, 1, CoordAtt, [512]]         # 25        ← Coordinate Attention

  - [-1, 1, Conv, [512, 3, 2]]       # 26
  - [[-1, 13], 1, Concat, [1]]       # 27  cat P4_down + P5_sppf
  - [-1, 3, C2f, [1024]]             # 28  (P5/32-large)
  - [-1, 1, CoordAtt, [1024]]        # 29        ← Coordinate Attention

  # --- Detection heads ---
  - [[21, 25, 29], 1, Detect, [nc]]  # 30  Detect(P3, P4, P5)
